PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
/**
 * @file cdr_canDriver.c
 * CAN communication driver for DEVKIT-MPC5748G and safe-RTOS. Main file of implementation.
 * It instantiates the constant configuration data object, initializes the driver according
 * to the configuration settings and offer the global API functions.
 *
 * Copyright (C) 2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   cdr_getNoFIFOFilterEntries (global inline)
 *   cdr_getIdxOfFirstNormalMailbox (global inline)
 *   cdr_getMailboxByIdx (global inline)
 *   cdr_osInitCanDriver
 *   cdr_osMakeMailboxReservation
 *   cdr_osSendMessage_idMB
 *   cdr_osSendMessage
 *   cdr_osSendMessageEx
 *   cdr_osReadMessage_idMB
 *   cdr_osReadMessage
 *   cdr_testSend_task10ms
 * Local functions
 *   getFIFOFilterEntry
 *   configSIULForUseWithDEVKIT_MPC5748G
 *   getBaudRateSettings
 *   osPrepareSendMessage
 */

/*
 * Include files
 */

#include <stddef.h>
#include <string.h>
#include <limits.h>
#include <assert.h>

#include "MPC5748G.h"
#include "cdr_MPC5748G_CAN.h"

#include "typ_types.h"
#include "sio_serialIO.h"
#include "ccl_configureClocks.h"
#include "cdr_checkConfig.h"
#include "cdr_interruptServiceHandlers.h"
#include "cdr_canDriverAPI.h"
#include "cdr_canDriver.h"


/*
 * Defines
 */

/** Initializer expression for an entry of the array \a cdr_canDriverData. */
#define INIT_CAN_DEVICE_DATA(canDev)    \
    [cdr_canDev_##canDev] =             \
    {                                   \
        .isBusOff = false,              \
        .noRxFIFOOverflowEvents = 0,    \
        .noRxFIFOWarningEvents = 0,     \
        .noRxMsgsFIFO = 0,              \
    },

/*
 * Local type definitions
 */

/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/* Read the source code include file, which defines the large configuration data set. */
#define CDR_IS_INCLUDED_FROM_DRIVER_IMPLEMENTATION
#include "cdr_canDriver.config.inc"

/** This is a lookup table, which maps a zero based CAN device index (enumeration
    cdr_enumCanDevice_t) to a CAN peripheral (according to MPC5748G.h) */
CAN_Type * const RODATA(cdr_mapIdxToCanDevice)[cdr_canDev_noCANDevicesEnabled] =
{
#if CDR_ENABLE_USE_OF_CAN_0 == 1
    CAN_0,
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
    CAN_1,
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
    CAN_2,
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
    CAN_3,
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
    CAN_4,
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
    CAN_5,
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
    CAN_6,
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
    CAN_7,
#endif
};


/** The run-time data of the CAN driver.\n
      The principal structure of the object is an array of objects of class \a
    cdr_canDeviceData_t, which hold the run-time data for a single CAN device (the
    devices are operated widely independent from one another). */
cdr_canDriverData_t DATA_OS(cdr_canDriverData) =
{
#if CDR_ENABLE_USE_OF_CAN_0 == 1
    INIT_CAN_DEVICE_DATA(CAN_0)
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
    INIT_CAN_DEVICE_DATA(CAN_1)
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
    INIT_CAN_DEVICE_DATA(CAN_2)
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
    INIT_CAN_DEVICE_DATA(CAN_3)
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
    INIT_CAN_DEVICE_DATA(CAN_4)
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
    INIT_CAN_DEVICE_DATA(CAN_5)
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
    INIT_CAN_DEVICE_DATA(CAN_6)
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
    INIT_CAN_DEVICE_DATA(CAN_7)
#endif
};
#undef INIT_CAN_DEVICE_DATA


/*
 * Function implementation
 */


/**
 * Get an entry from the FIFO filter table. In our configuration, an entry is of type A
 * only. Effectively it is the CAN ID, which can be received through the FIFO. See RM
 * 43.4.43, Tables 43-17 and 43-18, on p. 1786 for details.
 *   @return
 * The pointer to the filter entry is returned. The result is undefined if the FIFO is not
 * enabled.
 *   @param pCanDevice
 * The CAN device in use is passed by reference. It'll be one entry out of #CAN_BASE_PTRS
 * (see MPC5748G.h); this is however not checked.
 *   @param idxFilterEntry
 * The index of the filter entry.\n
 * The range is 0..max, which is checked by assertion. "max" depends on the FIFO
 * configuration. In our default configuration (CTRL2[RFFN]=8) it is 71. See RM 43.4.14, p.
 * 1740.
 *   @remark
 * The current configuration of the device, e.g. FIFO enabled or not or the filter table
 * size, is not considered by the function. It just provides the simple address
 * calculation.
 */
static inline uint32_t *getFIFOFilterEntry( const CAN_Type * const pCanDevice
                                          , unsigned int idxFilterEntry
                                          )
{
    /* The filter table starts a byte offset 0xe0, the RAM starts at byte offset 0x80. */
    return (uint32_t*)((uint8_t*)&pCanDevice->RAMn[0]
                       + (0xe0 - 0x80)
                       + idxFilterEntry*sizeof(uint32_t)
                      );
} /* End of getFIFOFilterEntry */





#if CDR_ENABLE_USE_OF_CAN_0 == 1
/**
 * Do the configuration of the MCU pins such that CAN device CAN_0 can communicated through
 * the CAN transceiver, which is mounted on the board.\n
 *   The code in this function is not generally usable.
 */
static void configSIULForUseWithDEVKIT_MPC5748G(void)
{
    /* RM 15.2.11, Multiplexed Signal Configuration Register, p. 388ff: Route Tx output of
       device CAN_0 to MCU pin PB0, which is connected to the Tx input of the external
       transceiver chip on the board DEVKIT-MPC5748G. */
    const unsigned int idxSIUL_PB0 = 16
                     , idxSIUL_PB1 = 17
                     , idxIMCR_PB1 = 188;
    SIUL2->MSCR[idxSIUL_PB0] =
                SIUL2_MSCR_SSS(1)   /* Source signal is CAN0_TX */
                | SIUL2_MSCR_SRC(3) /* Slew rate: Full drive without SR control */
                | SIUL2_MSCR_OBE(1) /* Enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(0) /* Disable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;

    /* Rx output of external transceiver chip is connected to pin PB1 of the MCU. Configure
       this pin as input. */
    SIUL2->MSCR[idxSIUL_PB1] =
                SIUL2_MSCR_SSS(0)   /* Doesn't care for input */
                | SIUL2_MSCR_SRC(0) /* Doesn't care for input */
                | SIUL2_MSCR_OBE(0) /* Don't enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(1) /* Enable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;

