PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    /* RM 15.2.12, p. 391, input multiplexer: Rx output of external transceiver chip is
       connected to pin PB1 of the MCU. Route PB1 to the Rx input of CAN device CAN_0. */
    SIUL2->IMCR[idxIMCR_PB1] = SIUL2_IMCR_SSS(2);

} /* End of configSIULForUseWithDEVKIT_MPC5748G */
#endif /* CDR_ENABLE_USE_OF_CAN_0 == 1 */




/**
 * Helper function: Figure out, how to set the prescaler and counter registers of the
 * device to achieve a given Baud rate.\n
 *  The function doesn't return an error. All possible fault conditions have been checked
 * before.
 *   @param pPRESDIV 
 * The required value PRESDIV is returned by reference.
 *   @param pPROPSEG  
 * The required value PROPSEG is returned by reference.
 *   @param pPSEG1    
 * The required value PSEG1 is returned by reference.
 *   @param pPSEG2    
 * The required value PSEG2 is returned by reference.
 *   @param baudRate
 * The desired Baud rate in the unit 10 kBd.
 */
static void getBaudRateSettings( unsigned int * const pPRESDIV
                               , unsigned int * const pPROPSEG
                               , unsigned int * const pPSEG1  
                               , unsigned int * const pPSEG2
                               , unsigned int baudRate
                               )
{
    /* Bit-Timing: See RM 43.5.9.7, p. 1823ff and in particular Figure 43-7, p. 1826.
         A CAN bit is splitted into two halfs to set the 1 or 3 sample points somewhere in
       the middle. All units are the "time quantum", which is the "serial clock", the input
       clock diveded by (PRESDIV+1). We choose 5 MHz as serial clock or 200ns as time
       quantum.
         The time span prior to sampling (in case of taking 1 sample) has a length of
       PROPSEG+PSEG1+3 quanta and the time after has PSEG2+1 quanta. (The constant
       addends result from the encoding of the registers; register+1 yields time
       designation.)
         Note, if three samples are taken then the additional two occur at two and one time
       quantum earlier than with one sample. */
    #define BD250_CAN_BD_RATE 250000
    #define BD250_PRESDIV     9
    #define BD250_PROPSEG     6
    #define BD250_PSEG1       3
    #define BD250_PSEG2       3
    _Static_assert( ((float)(BD250_PRESDIV+1)/CCL_XTAL_CLK) /* time quantum in s as float */
                    * (BD250_PROPSEG+BD250_PSEG1+3 + BD250_PSEG2+1) /* no quant. per CAN bit */
                    == 1.0f/BD250_CAN_BD_RATE
                  , "CAN timer configuration doesn't hit intended Baud rate 250 kBd"
                  );

    #define BD500_CAN_BD_RATE 500000
    #define BD500_PRESDIV     4
    #define BD500_PROPSEG     6
    #define BD500_PSEG1       3
    #define BD500_PSEG2       3
    _Static_assert( ((float)(BD500_PRESDIV+1)/CCL_XTAL_CLK) /* time quantum in s as float */
                    * (BD500_PROPSEG+BD500_PSEG1+3 + BD500_PSEG2+1) /* no quant. per CAN bit */
                    == 1.0f/BD500_CAN_BD_RATE
                  , "CAN timer configuration doesn't hit intended Baud rate 500 kBd"
                  );

    #define BD1000_CAN_BD_RATE 1000000
    #define BD1000_PRESDIV     4
    #define BD1000_PROPSEG     2
    #define BD1000_PSEG1       1
    #define BD1000_PSEG2       1
    _Static_assert( ((float)(BD1000_PRESDIV+1)/CCL_XTAL_CLK) /* time quantum in s as float */
                    * (BD1000_PROPSEG+BD1000_PSEG1+3 + BD1000_PSEG2+1) /* no quant. per bit */
                    == 1.0f/BD1000_CAN_BD_RATE
                  , "CAN timer configuration doesn't hit intended Baud rate 1 MBd"
                  );

    switch(baudRate)
    {
    case 25:
        *pPRESDIV = BD250_PRESDIV;
        *pPROPSEG = BD250_PROPSEG;
        *pPSEG1   = BD250_PSEG1;
        *pPSEG2   = BD250_PSEG2;
        break;

    default:
        assert(false);
    case 50:
        *pPRESDIV = BD500_PRESDIV;
        *pPROPSEG = BD500_PROPSEG;
        *pPSEG1   = BD500_PSEG1;
        *pPSEG2   = BD500_PSEG2;
        break;

    case 100:
        *pPRESDIV = BD1000_PRESDIV;
        *pPROPSEG = BD1000_PROPSEG;
        *pPSEG1   = BD1000_PSEG1;
        *pPSEG2   = BD1000_PSEG2;
        break;
    }



} /* End of getBaudRateSettings */



/**
 * Initialization of one CAN device. This function is called once per enabled CAN device
 * from the driver initialization.
 *   @return
 * \a true, if function succeeded, else \a false.
 *   @param idxCanDevice
 * The CAN device to initialize by index. The available index range depends on the
 * configuration of the set of enabled CAN devices, see e.g. #CDR_ENABLE_USE_OF_CAN_0. The
 * most convenient way to provide the appropriate index is using enumeration
 * cdr_enumCanDevice_t.
 *   @remark
 * Needs to be called from supervisor code only.
 */
static void initCanDevice(unsigned int idxCanDevice)
{
    /* Look up the CAN device and the related driver configuration. */
    _Static_assert( sizeOfAry(cdr_canDriverConfig) == sizeOfAry(cdr_mapIdxToCanDevice)
                  , "Invalid CAN driver configuration"
                  );
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    CAN_Type * const pCanDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pCanDevConfig = &cdr_canDriverConfig[idxCanDevice];

    /* RM 43.6.1, initialization: First, we need to bring the device in disabled mode to
       set the clock source. On leaving the disabled mode, the device automatically enters
       the freeze mode, which is a prerequisite for being able to write the majority of
       registers. After configuration of all needed registers, we leave the freeze mode and
       the device becomes active.
         Note, a (soft) reset of the device is possible. Maybe, we need to consider it if
       we implement a re-initialization of the driver. The current implementation is proven
       only after out-of-reset. */

    /* Demand disable mode by setting the bit MDIS and wait for acknowledge. */
    pCanDevice->MCR |= CAN_MCR_MDIS_MASK;
    #define STS_MASK_DISABLED   (CAN_MCR_MDIS_MASK | CAN_MCR_NOTRDY_MASK | CAN_MCR_LPMACK_MASK)
    while((pCanDevice->MCR & STS_MASK_DISABLED) != STS_MASK_DISABLED)
        ;
    #undef STS_MASK_DISABLED

