PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    /* Install required interrupt handlers. By default, we have the three FIFO related
       IRQs. Later, at registration time of mailboxes, there may come many more. */
    cdr_osRegisterInterrupts(idxCanDevice);

    /* Finally, leave the freeze mode. Wait for state transition. */
    pCanDevice->MCR &= ~(CAN_MCR_FRZ_MASK | CAN_MCR_HALT_MASK);
    #define STS_MASK_RUNNING   (CAN_MCR_FRZACK_MASK | CAN_MCR_NOTRDY_MASK)
    while((pCanDevice->MCR & STS_MASK_RUNNING) != 0)
        ;
    #undef STS_MASK_RUNNING

#undef CLKSRC
} /* End of initCanDevice */




/**
 * Initialization of the CAN driver. Call this function once after startup of the software
 * and only from a single core.
 *   @remark
 * Needs to be called from supervisor code only.
 */
void cdr_osInitCanDriver(void)
{
    /* Check user provided driver configuration. Note, even a check only in DEBUG
       compilation is sufficient as it is all about static compile-time constant data.
       There won't ever be a problem in the PRODUCTION code if the check succeeded once in
       DEBUG compilation. */
    assert(cdr_checkDriverConfiguration());

    /* Check helper function by sample tests. */
    assert((uintptr_t)getFIFOFilterEntry(CAN_0, 0) == 0xffec00e0u
           &&  (uintptr_t)getFIFOFilterEntry(CAN_0, 71) == 0xffec00e0u + 71*4
           &&  (uintptr_t)getFIFOFilterEntry(CAN_7, 71) == 0xfbecc0e0u + 71*4
          );

    unsigned int idxCanDev;
    for(idxCanDev=0; idxCanDev<(unsigned)cdr_canDev_noCANDevicesEnabled; ++idxCanDev)
        initCanDevice(idxCanDev);

#if CDR_ENABLE_USE_OF_CAN_0 == 1
    /* Configure the MCU pins so that the external circuitry is connected to the MCU
       internal CAN device we've just configured. */
    configSIULForUseWithDEVKIT_MPC5748G();
#endif
} /* End of cdr_osInitCanDriver */





/**
 * Application dependent initialization of CAN communication: The driver will react only on
 * CAN message, it has agreed on with the application SW. This API is intended for making
 * such an agreement. By calling this function, the application requests one particular
 * CAN mailbox in the hardware for a particular message, for either reception or
 * transmission.
 *   @return
 * Mailbox reservation can fail. Mainly, because the number of outermost processable
 * messages is limited. The total number of all messages is limited by hardware and the
 * driver has no implementation of virtualization; if the Rx FIFO is enabled then numbers
 * of Rx and Tx messages even have different, indivdual limits.\n
 *   The function returns \a cdr_errApi_noError in case of success. In all other cases it
 * has not effect.\n
 *   All possible errors are static configuration errors in the client code. There's no
 * need to have a dynamic error check at run-time. The appropriate way to handle the return
 * code of this function is an assertion in DEBUG compilation. If it proves once that the
 * function returns \a cdr_errApi_noError then there's no risk to ever see another return
 * code in PRODUCTION compilation.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_enumCanDevice_t (actually a zero based index) for the set of
 * possible devices.\n
 *   @param hMB
 * The driver has a fixed structure of mailboxes. (A structure, which is modifiable by
 * configuration only to little extend: FIFO on/off, size of FIFO filter table).
 * Consequently, all mailboxes have a fixed index and we use this index as a handle to
 * refer to a particular mailbox. Usually, a driver will deal out a handle. Our driver
 * doesn't do but lets the client code choose the appropriate handle. The reason is that
 * the mailboxes have differing properties, which are known to the client code. By letting
 * it chosse the handle, hence the mailbox, it can decide, which mailbox suits best.
 * Relevant differences between mailboxes are:\n
 *   - The first n mailboxes belong to the Rx FIFO. They can't by used for transmission. n
 * depends on the configuration of the FIFO. The remaining, normal mailboxes are available
 * to Rx or Tx\n
 *   - The normal mailboxes are organized in groups of 4, 16 or 32. Each of these groups
 * can have a different interrupts, depending on the driver configuration. Different
 * interrupts means different priority, processed on different cores and/or using
 * different notification callbacks.\n
 *   The range of hMB is 0..N, where N depends on the chosen configuration.\n
 *   Details on how n and N relate to the made configuration can be found below.\n
 *   An out of range handle or using a handle, which had already been used in an earlier
 * call of this function, is considered an error.\n
 *   Note, each CAN device has its own, individual space of handle values.
 *   @param isExtId
 * Standard and extended CAN IDs partly share the same space of numbers. Hence, we need the
 * additional Boolean information, which of the two the ID \a canId belongs to.
 *   @param canId
 * The standard or extended ID of the CAN message, which the mailbox reservation is made
 * for.
 *   @param isReceived
 * The Boolean information, whether the mailbox is prepared for reception (\a true) of
 * transmission (\a false).
 *   @param TxDLC
 * The number of bytes of a Tx message in the range 0..8.\n
 *   The value doesn't care for Rx messages and it doesn't even care for Tx messages if
 * the send API cdr_osSendMessageEx() is exclusively used. The simple send API
 * cdr_osSendMessage(), however, will send the messages with this TxDLC. The range is 0..8.
 *   @param doNotify
 * The Boolean choice whether or not the completion of the mailbox activity will trigger an
 * interrupt. If set to \a true then an Rx mailbox will raise an interrupt if the reception
 * buffer has just been filled with a message from the bus and an Tx mailbox will raise the
 * interrupt when it has entirely serialized a message on the bus. By callback invokation,
 * the interrupt handler notifies the client code about the event and provides it the
 * required information (e.g. message payload for Rx mailboxes).\n
 *   The choice of the notification callback is made in the driver configuration. All
 * mailboxes of one group share the same callback.\n
 *   It is considered an error if a notification is requested for a mailbox that belongs to
 * a group, which is no interrupt configured for.
 *   @remark
 * The number n of FIFO mailboxes is 8*(CTRL2_RFFN+1) if the FIFO is enabled
 * (isFIFOEnabled=true) and 0 otherwise. CTRL2_RFFN and isFIFOEnabled are compile-time
 * constants in the driver configuration. Handle values 0..(n-1) make a CAN message
 * received via FIFO.\n
 *   The number m of normal mailboxes is (noMailboxes-8-2*CTRL2_RFFN) if the FIFO is
 * enabled (isFIFOEnabled=true) and noMailboxes otherwise. noMailboxes, CTRL2_RFFN and
 * isFIFOEnabled are compile-time constants in the driver configuration. Handle values
 * n..(n+m-1) place a CAN message in a normal mailbox. The massage can be either Rx or
 * Tx.\n
 *   The total number N=n+m of processable CAN messages is noMailboxes+6*CTRL2_RFFN if the
 * FIFO is enabled (isFIFOEnabled=true) and noMailboxes otherwise. noMailboxes, CTRL2_RFFN
 * and isFIFOEnabled are compile-time constants in the driver configuration. This number is
 * available as cdr_maxNoCanIds(), too.
 *   @remark
 * The hardware provides plenty of mailboxes. Therefore, we decided not to make the
 * acceptance mask available to the client code. This mask would allow sharing a mailbox
 * between a set of CAN messages with similar CAN IDs. This mechanism has some deficiencies
 * in terms of ease of use and wouldn't be available to all mailboxes in a homogenous way.
 */
cdr_errorAPI_t cdr_osMakeMailboxReservation( unsigned int idxCanDevice
                                           , unsigned int hMB
                                           , bool isExtId
                                           , unsigned int canId
                                           , bool isReceived
                                           , unsigned int TxDLC
                                           , bool doNotify
                                           )
{
    if(idxCanDevice >= sizeOfAry(cdr_canDriverConfig))
        return cdr_errApi_handleOutOfRange;

