PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
        /* See RM 43.4.40, p. 1771, for the fields of the mailbox. See Table 43-8, p.
           1772ff, for the Rx mailbox status and command CODEs. */
        pMB->csWord = CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                      | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                      | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                      | CAN_MBCS_CODE(CODE)
                      | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                      | CAN_MBCS_IDE(isExtId? 1u: 0u)/* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                      | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                      | CAN_MBCS_DLC(TxDLC) /* Size of frame, doesn't care for Rx. */
                      | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care is set on transmission */
                      ;
        pMB->canId = CAN_MBID_PRIO(0u)   /* We don't use the local prio value. */
                     | (isExtId? CAN_MBID_ID_EXT(canId): CAN_MBID_ID_STD(canId));
    }
    else
        return cdr_errApi_handleOutOfRange;

    return cdr_errApi_noError;

} /* End of cdr_osMakeMailboxReservation. */



/**
 * Comman part of the two APIs to send a Tx message. It checks the mailbox state and
 * prepares it for sending. It does not copy the payload and it doesn't trigger sending
 * yet.
 *   @return
 * The pointer to the affected mailbox if function succeeds, else \a NULL. The latter can
 * happen, if the buffer in the hardware is still occupied by the preceeding message, which
 * has not yet serialized on the CAN bus.\n
 *   If the function returns \a NULL then the caller must not proceed with sending.
 *   @param pIdMB
 * Object * \a pIdMB contains the information about the mailbox to operate on (i.e.
 * device, HW index of mailbox).
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message. This function can be used to implement a send queue: If it returns \a
 * false then the message is appended to the queue. The notification callback checks the
 * queue and sends the heading element - if any - using this function.
 */
static volatile cdr_mailbox_t *osPrepareSendMessage(const cdr_idMailbox_t * const pIdMB)
{
    CAN_Type * const pDevice = pIdMB->pDevice;
    const unsigned int idxMB = pIdMB->idxMailbox;

    /* Get the pointer to the mailbox in use. */
    volatile cdr_mailbox_t * const pTxMB = cdr_getMailboxByIdx(pDevice, idxMB);

    /* Read status word of MB and decide whether we may send (already again). */
    const uint32_t csWord = pTxMB->csWord
                 , CODE = (csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
    if(CODE == 8 /* TX ACTIVE */)
    {
        /* The MB is basically free. There's still an important consideration. Sending may
           be done with or without IRQ notification and in either case we need to
           acknowledge the interrupt from the preceeding Tx - otherwise the MB is blocked
           (RM 43.5.1, p. 1789). If notification is enabled then there are possible race
           conditions: Will the ISR or do we here reset the flag?
             The normal usecase of Tx notifications is virtualization of MBs by buffering:
           The application code interface "sends" the message by putting it in a SW buffer
           only. On each Tx notification from the CAN driver, the next element from the
           buffer is passed on to the driver, i.e. to this function. In this use case, the
           notification IRQ will always come prior to the next call of this function and
           so the interrupt is already negated on entry into this function.
             Consequently, if we unconditionally negate the flag here, then we either do,
           what we need to do (if no Tx notification is configured) or what is useless but
           doesn't do any harm (if no Tx notification is configured and already negated the
           flag). */

        /* Unconditionally clear a possibly pending interrupt bit (RM 43.4.12/13/21, p.
           1735ff) and thereby unlock the mailbox. */
        if(idxMB < 32)
        {
            const uint32_t mask = 1u << idxMB;
            pDevice->IFLAG1 =  mask; /* Clear IRQ bit by "w1c". */
        }
        else if(idxMB < 64)
        {
            const uint32_t mask = 1u << (idxMB-32u);
            pDevice->IFLAG2 =  mask; /* Clear IRQ bit by "w1c". */
        }
        else
        {
            assert(idxMB < 96);
            const uint32_t mask = 1u << (idxMB-64u);
            pDevice->IFLAG3 =  mask; /* Clear IRQ bit by "w1c". */
        }

        /* Sending is possible, return mailbox for completion of operation. */
        return pTxMB;
    }
    else
    {
        /* Mailbox is still busy or not even a Tx mailbox. Nothing can be done. */
        return NULL;
    }
} /* End of osPrepareSendMessage */




/**
 * Send a Tx message. This API is an alias for cdr_osSendMessage() with slightly different
 * signature. This API is intended for internal use only. Behavior is otherwise identical
 * to cdr_osSendMessage(); please look there for details.
 *   @return
 * Get an error code, which reports success or different recognized error situations.
 *   @param pIdMB
 * Object * \a pIdMB contains the information about the mailbox to operate on (i.e.
 * device, HW index of mailbox).
 *   @param payload
 * The message content bytes to sent. The number of bytes to send is taken from the current
 * mailbox configuration. Normally, it'll be the never changed value aggreed on during the
 * reservation of the mailbox (see cdr_osMakeMailboxReservation()). However, if the
 * extended send API cdr_osSendMessageEx() is used alternatingly with this simple API then
 * the DLC will be applied, which had been set with the last recent call of the extended API.
 */
cdr_errorAPI_t cdr_osSendMessage_idMB( const cdr_idMailbox_t * const pIdMB
                                     , const uint8_t payload[]
                                     )
{
    /* Check and prepare the mailbox to be used and get the pointer to it. */
    volatile cdr_mailbox_t * const pTxMB = osPrepareSendMessage(pIdMB);

    /* Complete send operation if preparation reports success. */
    if(pTxMB != NULL)
    {
        /* Read the status word of the mailbox. */
        const uint32_t csWord = pTxMB->csWord;

        /* Copy sent data into the mailbox. */
        const unsigned int DLC = (csWord & CAN_MBCS_DLC_MASK) >> CAN_MBCS_DLC_SHIFT;
        assert(DLC <= 8);
        memcpy((void*)&pTxMB->payload[0], payload, DLC);

        /* Changeing the C/S word in the MB initiates the transmission. See RM, Table 43-9, p.
           1775, for the Tx mailbox status and command CODEs.
             A read-modify-write is required as we must not alter the bit IDE. */
        pTxMB->csWord = csWord | CAN_MBCS_CODE(12); /* CODE doesn't need masking: 8->12 */

        /* Sending is successfully initiated. */
        return cdr_errApi_noError;
    }
    else
    {
        /* Mailbox is still busy. Nothing to be done. */
        return cdr_errApi_txMailboxBusy;
    }
} /* End of cdr_osSendMessage_idMB */



/**
 * Send a Tx message. This API (as opposed to cdr_osSendMessageEx()) for the simple but
 * common use case where each CAN ID is connected to one particular mailbox (or message
 * handle).\n
 *   "Sending" means placing it into the mailbox, i.e. the reserved buffer
 * in the CAN device hardware. The hardware decides autonomously, when the buffer is
 * serialized on the CAN bus. Usually, this will happen much later then the return from
 * this function. (An interrupt can be configured to get a notification when it is
 * completed. See cdr_osMakeMailboxReservation() for details.)
 *   @return
 * \a cdr_errApi_noError, if function succeeded, \a cdr_errApi_txMailboxBusy, if the buffer
 * in the hardware is still occupied by the preceeding message, which iss not serialized on
 * the CAN bus yet or \a cdr_errApi_handleOutOfRange if the device index or mailbox
 * handle was invalid.\n
 *   If the function doesn't return \a cdr_errApi_noError then it had no effect.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_enumCanDevice_t (actually a zero based index) for the set of
 * possible devices.
 *   @param hMB
 * The message to send is identified by the handle of the mailbox it is associated with. A
 * message can be send only if it had been associated with a mailbox in the hardware, i.e.
 * a successful call of cdr_osMakeMailboxReservation() is prerequisite of using this
 * function. The handle to use here is the same as used when having done the related call
 * of cdr_osMakeMailboxReservation().
 *   @param payload
 * The message content bytes to send. The number of bytes to send is taken from the current
 * mailbox configuration. Normally, it'll be the never changed value aggreed on during the
 * reservation of the mailbox (see cdr_osMakeMailboxReservation()). However, if the
 * extended send API cdr_osSendMessageEx() is used alternatingly with this simple API then
 * the DLC will be applied, which had been set with the last recent call of the extended API.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message.
 *   @remark
 * This API and cdr_osSendMessageEx() are alternatives. They access the same hardware and
 * have heavy race conditions. They must never be used at a time for one and the same
 * mailbox. Most use cases will lead to a general either or in the client code but the
 * non-overlapping over time, alternating use is permitted, too.
 *   @remark
 * This function is reentrant with respect to different addressed mailboxes. It can be
 * called from different cores. The behavior is undefined if called coincidentally from
 * different contexts but for the same mailbox. 
 */
cdr_errorAPI_t cdr_osSendMessage( unsigned int idxCanDevice
                                , unsigned int hMB
                                , const uint8_t payload[]
                                )
{
    cdr_idMailbox_t idMB;
    if(cdr_mapMailboxHandleToId(&idMB, idxCanDevice, hMB))
        return cdr_osSendMessage_idMB(&idMB, payload);
    else
        return cdr_errApi_handleOutOfRange;
        
