PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
} /* End of cdr_osSendMessage */



/**
 * Send a Tx message. This API (as opposed to cdr_osSendMessage()) may be used if one and
 * the same mailbox is applied to transmit messages of variable length or with varying CAN
 * ID.\n
 *   "Sending" means placing it into the mailbox, i.e. the reserved buffer
 * in the CAN device hardware. The hardware decides autonomously, when the buffer is
 * serialized on the CAN bus. Usually, this will happen much later then the return from
 * this function. (An interrupt can be configured to get a notification when it is
 * completed. See cdr_osMakeMailboxReservation() for details.)
 *   @return
 * \a cdr_errApi_noError, if function succeeded, \a cdr_errApi_txMailboxBusy, if the buffer
 * in the hardware is still occupied by the preceeding message, which iss not serialized on
 * the CAN bus yet or \a cdr_errApi_handleOutOfRange if the device index or mailbox
 * handle was invalid.\n
 *   If the function doesn't return \a cdr_errApi_noError then it had no effect.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_enumCanDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is caught by assertion.
 *   @param hMB
 * The message to send is identified by the handle of the mailbox it is associated with. A
 * message can be send only if it had been associated with a mailbox in the hardware, i.e.
 * a successful call of cdr_osMakeMailboxReservation() is prerequisite of using this
 * function. The handle to use here is the same as used when having done the related call
 * of cdr_osMakeMailboxReservation(). An out of range situation is caught by assertion.
 *   @param isExtId
 * Standard and extended CAN IDs partly share the same space of numbers. Hence, we need the
 * additional Boolean information, which of the two the ID \a canId belongs to.
 *   @param canId
 * The standard or extended ID of the CAN message to send. See \a isExtId, too.
 *   @param DLC
 * The number of bytes to send in the range 0..8. An out of range situation is caught by
 * assertion.
 *   @param payload
 * The \a DLC message content bytes, which are sent.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message. This function can be used to implement a send queue: If it returns \a
 * false then the message is appended to the queue. The notification callback checks the
 * queue and sends the heading element - if any - using this function.
 *   @remark
 * This API and cdr_osSendMessage() are alternatives. They access the same hardware and
 * have heavy race conditions. They must never be used at a time for one and the same
 * mailbox. Most use cases will lead to a general either or in the client code but the
 * non-overlapping over time, alternating use is permitted, too.
 *   @remark
 * This function is reentrant with respect to different addressed mailboxes. It can be
 * called from different cores. The behavior is undefined if called coincidentally from
 * different contexts but for the same mailbox. 
 */
cdr_errorAPI_t cdr_osSendMessageEx( unsigned int idxCanDevice
                                  , unsigned int hMB
                                  , bool isExtId
                                  , unsigned int canId
                                  , unsigned int DLC
                                  , const uint8_t payload[]
                                  )
{
    cdr_idMailbox_t idMB;
    if(!cdr_mapMailboxHandleToId(&idMB, idxCanDevice, hMB))
        return cdr_errApi_handleOutOfRange;
        
    /* Check and prepare the mailbox to be used and get the pointer to it. */
    volatile cdr_mailbox_t * const pTxMB = osPrepareSendMessage(&idMB);

    /* Complete send operation if preparation reports success. */
    if(pTxMB != NULL)
    {
        /* Set the CAN ID to be used this time with the mailbox. */
        pTxMB->canId = CAN_MBID_PRIO(0u)   /* We don't use the local prio value. */
                       | (isExtId? CAN_MBID_ID_EXT(canId): CAN_MBID_ID_STD(canId));

        /* Copy sent data into the mailbox. */
        assert(DLC <= 8);
        memcpy((void*)&pTxMB->payload[0], payload, DLC);

        /* Changeing the C/S word in the MB initiates the transmission. See RM, Table 43-9, p.
           1775, for the Tx mailbox status and command CODEs. */
        pTxMB->csWord =
                CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                | CAN_MBCS_CODE(12)   /* 12, DATA, triggers Tx. */
                | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                | CAN_MBCS_IDE(isExtId? 1: 0) /* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                | CAN_MBCS_DLC(DLC) /* no FD: n=no bytes, FD: see RM, Table 43-10, p. 1777. */
                | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care if set on transmission */
                ;

        /* Sending is successfully initiated. */
        return cdr_errApi_noError;
    }
    else
    {
        /* Mailbox is still busy. Nothing to be done. */
        return cdr_errApi_txMailboxBusy;
    }
} /* End of cdr_osSendMessageEx */



/**
 * Read an Rx message from the mailbox. This variant of the function takes the resolved
 * mailbox identification as argument. The normal API function is \a cdr_osReadMessage().
 * (It resolves the mailbox identification and branches here.) Please find more detailled
 * information there.
 *   @return
 * If the function returns either \a cdr_errApi_noError or \a cdr_errApi_warningRxOverflow
 * then a new message had been arrived and the mailbox contents are returned to the
 * caller.\n
 *   \a cdr_errApi_noError should be the normal case, while \a cdr_errApi_warningRxOverflow
 * indicates that the call of the function came too late to read all incoming messages; at
 * least one preceeding message had been lost and overwritten by it successor.\n
 *   If no new data is available (no message had been received since the previous call of
 * this function for the same mailbox or the mailbox is instantly blocked by a
 * coincidental reception event) then the function returns \a cdr_errApi_rxMailboxEmpty.\n
 *   \a cdr_errApi_rxMailboxEmpty is returned, too, if one tries to read from a mailbox,
 * which had been configured for Tx.\n
 *   None of the other (pointer based) function results is set if the return code is other
 * than \a cdr_errApi_noError or \a cdr_errApi_warningRxOverflow.
 *   @param pIdMB
 * Object * \a pIdMB contains the information about the mailbox to operate on (i.e.
 * device, HW index of mailbox).
 *   @param pDLC
 * At entry into this function, * \a pDLC is the size in Byte of the output buffer \a
 * payload. No more than this number of payload bytes will be returned.\n
 *   After return, the caller will find the received number of bytes in * \a pDLC.
 *   @param payload
 * The received \a DLC message content bytes are placed into this buffer.
 *   @param pTimeStamp
 * The time of reception of the message is recorded by hardware and the value is returned
 * as * \a pTimeStamp. The absolute value has not meaning, time-base is a free running 16
 * Bit counter. The frequency of the timer is the CAN bit rate; having a bus with 500 kBd
 * the unit of the timer would be 2µs. The timer wraps around at 2^16-1.\n
 *   \a pTimeStamp can be NULL if the called doesn't want to make use of the time stamp.
 */
cdr_errorAPI_t cdr_osReadMessage_idMB( const cdr_idMailbox_t * const pIdMB
                                     , uint8_t * const pDLC
                                     , uint8_t payload[]
                                     , uint16_t * const pTimeStamp
                                     )
{
    CAN_Type * const pDevice = pIdMB->pDevice;
    const unsigned int idxMB = pIdMB->idxMailbox;

    /* Identify the interrupt bit that belongs to the given mailbox (RM 43.4.12/13/21, p.
       1735ff). */
    uint32_t irqMask;
    volatile uint32_t *pIFLAG;
    volatile uint32_t IMASK;
    if(idxMB < 32)
    {
        irqMask = 1u << idxMB;
        pIFLAG = &pDevice->IFLAG1;
        IMASK = pDevice->IMASK1;
    }
    else if(idxMB < 64)
    {
        irqMask = 1u << (idxMB-32u);
        pIFLAG = &pDevice->IFLAG2;
        IMASK = pDevice->IMASK2;
    }
    else
    {
        assert(idxMB < 96);
        irqMask = 1u << (idxMB-64u);
        pIFLAG = &pDevice->IFLAG3;
        IMASK = pDevice->IMASK3;
    }

    /* To avoid race conditions, we don't allow using this API for mailboxes, which are
       configured to send an IRQ based notification. */
    if((IMASK & irqMask) != 0)
        return cdr_errApi_pollingOfMailboxWithIRQ;

    /* Poll for newly received input; a new message is reported by interrupt flag. */
    if((*pIFLAG & irqMask) != 0)
    {
        /* Get the pointer to the mailbox in use. */
        volatile cdr_mailbox_t * const pRxMB = cdr_getMailboxByIdx(pDevice, idxMB);

        /* Read status word of MB. Field CODE tells more about normal reception or
           overflow. */
        const uint32_t csWord = pRxMB->csWord
                     , CODE = (csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
                     
        /* There is a little chance to access the mailbox during the move-in (likely of the
           successor message of the one, which had asserted the interrupt flag); the
           situation is recognized by a set LSB.
             From the perspective of the user interface, we handle this identical to the
           empty mailbox: Currently, the user can't get data. If it really is due to an
           overrun then he will necessarily see this in the next call of the polling
           method. */
        if(CODE == 2 /* FULL */  ||  CODE == 6 /* OVERRUN */)
        {
            const uint8_t DLC = (uint8_t)((pRxMB->csWord & CAN_MBCS_DLC_MASK)
                                          >> CAN_MBCS_DLC_SHIFT
                                         );

            /* Copy received bytes into caller provided result buffer. The loop considers
               both the provided buffer's size and the number of received bytes. The
               received DLC is limited to 8 by HW. */
            assert(DLC <= 8);
            unsigned int u = (unsigned)*pDLC;
            if((unsigned)DLC < u)
                u = (unsigned)DLC;
            while(u-- > 0)
                payload[u] = pRxMB->payload[u];
            *pDLC = DLC;

            /* Acknowledge the IRQ. */
            *pIFLAG = irqMask; /* Clear bit by "w1c" */

