PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
            /* RM 43.4.4, p. 1721f: Read the timer register to unlock the evaluated mailbox
               (side-effect of reading). See 43.5.7.3 Mailbox lock mechanism, p. 1808ff for
               more details. */
            (void)pDevice->TIMER;

            /* The time stamp of reception is returned on demand. */
            if(pTimeStamp != NULL)
            {
                *pTimeStamp = (uint16_t)((csWord & CAN_MBCS_TIME_STAMP_MASK)
                                         >> CAN_MBCS_TIME_STAMP_SHIFT
                                        );
            }

            /* RM 43.4.9, p. 1727: The error word CAN_ESR1 is related to the last recently
               received message but the bits are sticky. If the status is read by the CPU
               then they are reset otherwise they are held. So the CPU should read the word
               on each Rx event and relate the bits to the received message.
                 Careful: The bits are obviously meant to be read by interrupt (which is
               caused by them). Both at a time is impossible due to the reset-on-read and
               we tend to offer the interrupt. */

            return CODE == 2 /* FULL */? cdr_errApi_noError: cdr_errApi_warningRxOverflow;
        }
        else
            return cdr_errApi_rxMailboxEmpty;
    }
    else
        return cdr_errApi_rxMailboxEmpty;

} /* End of cdr_osReadMessage_idMB */




/**
 * Read an Rx message from the mailbox. This is the polling based receive API of the CAN
 * driver. The contents of the mailbox are returned if a message had been received since
 * the preceding invocation of this function for the same mailbox.\n
 *   Regularly polling a mailbox is an alternative to notification of reception by
 * interrupt and callback. For a given mailbox, either technologies can't be combined. This
 * is double-checked and the function returns \a cdr_errApi_pollingOfMailboxWithIRQ in case.
 *   @return
 * If the function returns either \a cdr_errApi_noError or \a cdr_errApi_warningRxOverflow
 * then a new message had been arrived and the mailbox contents are returned to the
 * caller.\n
 *   \a cdr_errApi_noError should be the normal case, while \a cdr_errApi_warningRxOverflow
 * indicates that the call of the function came too late to read all incoming messages; at
 * least one preceeding message had been lost and overwritten by it successor.\n
 *   If no new data is available (no message had been received since the previous call of
 * this function for the same mailbox or the mailbox is instantly blocked by a
 * coincidental reception event) then the function returns \a cdr_errApi_rxMailboxEmpty.
 *   \a cdr_errApi_rxMailboxEmpty is returned, too, if one tries to read from a mailbox,
 * which had been configured for Tx.\n
 *   None of the other (pointer based) function results is set if the return code is other
 * than \a cdr_errApi_noError or \a cdr_errApi_warningRxOverflow.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_enumCanDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is reported by return value \a
 * cdr_errApi_handleOutOfRange.\n
 *   \a cdr_errApi_pollingOfMailboxWithIRQ is returned if the read method is applied to a
 * mailbox, which had been configured for Tx.\n
 *   None of the other (pointer based) function results is set in case of an error.
 *   @param hMB
 * The message to send is identified by the handle of the mailbox it is associated with. A
 * message can be received only if it had been associated with a mailbox in the hardware, i.e.
 * a successful call of cdr_osMakeMailboxReservation() is prerequisite of using this
 * function. The handle to use here is the same as used when having done the related call
 * of cdr_osMakeMailboxReservation().\n
 *   Only normal mailboxe can be used for polling. The handle of a mailbox in the FIFO is
 * invalid. (I.e. handle value less than cdr_getNoFIFOFilterEntries().)\n
 *   An out of range situation is is reported by return value \a
 * cdr_errApi_handleOutOfRange. None of the other (pointer based) function results is
 * set in this case.
 *   @param pDLC
 * At entry into this function, * \a pDLC is the size in Byte of the output buffer \a
 * payload. No more than this number of payload bytes will be returned.\n
 *   After return, the caller will find the received number of bytes in * \a pDLC.
 *   @param payload
 * The received \a DLC message content bytes are placed into this buffer.
 *   @param pTimeStamp
 * The time of reception of the message is recorded by hardware and the value is returned
 * as * \a pTimeStamp. The absolute value has not meaning, time-base is a free running 16
 * Bit counter. The frequency of the timer is the CAN bit rate; having a bus with 500 kBd
 * the unit of the timer would be 2µs. The timer wraps around at 2^16-1.\n
 *   \a pTimeStamp can be NULL if the called doesn't want to make use of the time stamp.
 */
cdr_errorAPI_t cdr_osReadMessage( unsigned int idxCanDevice
                                , unsigned int hMB
                                , uint8_t * const pDLC
                                , uint8_t payload[]
                                , uint16_t * const pTimeStamp
                                )
{
    cdr_idMailbox_t idMB;
    if(cdr_mapMailboxHandleToId(&idMB, idxCanDevice, hMB))
        return cdr_osReadMessage_idMB(&idMB, pDLC, payload, pTimeStamp);
    else
        return cdr_errApi_handleOutOfRange;

} /* End of cdr_osReadMessage */



